---
type: IDuctFittingAndAccessoryPressureDropUIServer
namespace: Autodesk.Revit.UI.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# IDuctFittingAndAccessoryPressureDropUIServer

`Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDBServerId | 2014 | `Guid GetDBServerId ()` |
| Method | ShowSettings | 2014 | `bool ShowSettings ( DuctFittingAndAccessoryPressureDropUIData data )` |